DECLARE a NUMBER; b NUMBER; c NUMBER; d NUMBER;
BEGIN
 SELECT "ID_КЛЕТКИ" INTO a FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=1;
 SELECT "ID_КЛЕТКИ" INTO b FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=2;
 SELECT "ID_КЛЕТКИ" INTO c FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=11;
 SELECT "ID_КЛЕТКИ" INTO d FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=4;
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Премия',100,'Премия: +100 ₽.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Премия',50,'Возврат налога: +50 ₽.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Премия',50,'Небольшая награда: +50 ₽.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Штраф',50,'Штраф: −50 ₽.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Штраф',100,'Ремонт: −100 ₽.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Штраф',100,'Налог: −100 ₽.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (a,'Перемещение','Переместитесь на Старт.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (b,'Перемещение','Переместитесь на Домодедовскую.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (c,'Перемещение','Переместитесь на Добрынинскую.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (d,'Перемещение','Переместитесь на Картёж.');
END;
/
COMMIT;
