DECLARE a NUMBER; b NUMBER; c NUMBER; d NUMBER;
BEGIN
 SELECT "ID_КЛЕТКИ" INTO a FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=1;
 SELECT "ID_КЛЕТКИ" INTO b FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=2;
 SELECT "ID_КЛЕТКИ" INTO c FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=11;
 SELECT "ID_КЛЕТКИ" INTO d FROM "КЛЕТКИ" WHERE "ПОЗИЦИЯ"=4;
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Премия',100,'Получите премию 100.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Премия',50,'Получите возврат налога 50.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Премия',200,'Получите награду 200.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Штраф',50,'Оплатите штраф 50.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Штраф',100,'Оплатите ремонт 100.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ТИП_ЭФФЕКТА","СУММА_ИЗМЕНЕНИЯ","ТЕКСТ_СОБЫТИЯ") VALUES ('Штраф',150,'Оплатите налог 150.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (a,'Перемещение','Переместитесь на Старт.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (b,'Перемещение','Переместитесь на Улицу 1.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (c,'Перемещение','Переместитесь на Улицу 7.');
 INSERT INTO "КАРТЫ_ШАНСА" ("ID_ЦЕЛЕВОЙ_КЛЕТКИ","ТИП_ЭФФЕКТА","ТЕКСТ_СОБЫТИЯ") VALUES (d,'Перемещение','Переместитесь на Электростанцию.');
END;
/
COMMIT;
